In [608]:
import pandas as pd

In [609]:
# import data
df = pd.read_csv(r"C:\Users\carlo\TrainingsTool\Tennis\ML_Stuff\df_djoker_ready_to_split.csv", encoding="unicode_escape", low_memory=False)
df

,Unnamed: 0,Pts,Gm1,Gm2,Set1,Set2,Serving,0,1,2,...,44,45,46,47,48,49,50,51,52,53
0,0,0-0,0,0,0,0,ND,"4n,",4,f18,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,0-15,0,0,0,0,ND,"4n,",6,f2n#,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2,15-15,0,0,0,0,ND,"4*,",NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,3,30-15,0,0,0,0,ND,"4n,",5,b3n@,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,4,40-15,0,0,0,0,ND,4,r28,f1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19319,19319,0-15,5,4,1,1,ND,6,f38,b3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19320,19320,0-30,5,4,1,1,ND,"6w,",5,b39,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19321,19321,15-30,5,4,1,1,ND,4,b39,b3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19322,19322,30-30,5,4,1,1,ND,"4d,",4,f19,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19323,19323,40-30,5,4,1,1,ND,"6n,",5,f39,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [610]:
# drop redundant index
df = df.drop("Unnamed: 0", axis = 1)

In [611]:
# all rows where Djokovic is serving
df_serving = df[df.Serving == "ND"]
df_returning = df[df.Serving != "ND"]

In [612]:
len(df_serving), len(df_returning)

(9374, 9950)

In [613]:
first_serve_in_play = ["4", "5", "6"]

In [614]:
df_serving_1st = df_serving.loc[df_serving["0"].isin(first_serve_in_play)]
df_serving_1st

,Pts,Gm1,Gm2,Set1,Set2,Serving,0,1,2,3,...,44,45,46,47,48,49,50,51,52,53
4,40-15,0,0,0,0,ND,4,r28,f1,r2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,0-0,1,1,0,0,ND,4,r37,b+3,m2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,15-30,1,1,0,0,ND,4,b2n#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,30-30,1,1,0,0,ND,6,s1w#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,15-0,2,2,0,0,ND,4,s2n#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19311,30-15,4,3,1,1,ND,6,f3x#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19312,40-15,4,3,1,1,ND,4,f28,b1,f2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19318,0-0,5,4,1,1,ND,6,s18,f+1,l2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19319,0-15,5,4,1,1,ND,6,f38,b3,b3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19321,15-30,5,4,1,1,ND,4,b39,b3,b3n@,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [615]:
df_serving_1st["0"].value_counts()

0
4    2336
6    2241
5     384
Name: count, dtype: int64

In [616]:
df_serving_2nd = df_serving.loc[df_serving["1"].isin(first_serve_in_play)]
len(df_serving_2nd), df_serving_2nd["1"].value_counts()

(2845,
 1
 4    1014
 5     980
 6     851
 Name: count, dtype: int64)

In [617]:
df_returning_1st = df_returning.loc[df_returning["0"].isin(first_serve_in_play)]
len(df_returning_1st), df_returning_1st["0"].value_counts()

(5053,
 0
 4    2349
 6    2169
 5     535
 Name: count, dtype: int64)

In [618]:
df_returning_2nd = df_returning.loc[df_returning["1"].isin(first_serve_in_play)]
len(df_returning_2nd), df_returning_2nd["1"].value_counts()

(3073,
 1
 5    1372
 4     896
 6     805
 Name: count, dtype: int64)

In [619]:
# df_serving_1st #  "2" "4" "6" and so on are the relevant Djokovic shots
# df_serving_2nd # "3" "5" "7" and so on are the relevant Djokovic shots

# df_returning_1st "3" "5" "7" and so on are the relevant Djokovic shots
# df_returning_2nd "4" "6" and so on are the relevant Djokovic shots

In [620]:
df_serving_1st_all_shot_pairs = df_serving_1st[["1", "2"]]
df_serving_1st_all_shot_pairs = df_serving_1st_all_shot_pairs[df_serving_1st_all_shot_pairs['2'].notna()]
df_serving_1st_all_shot_pairs

         1    2
4      r28   f1
13     r37  b+3
25     r28   f1
31     b39   b2
33     f17  f+3
...    ...  ...
19301  f17  f+3
19312  f28   b1
19318  s18  f+1
19319  f38   b3
19321  b39   b3

[3652 rows x 2 columns]

In [621]:
df_addition1 = df_serving_1st[["3", "4"]]
df_addition1 = df_addition1[df_addition1["3"].notna()]
df_addition1 = df_addition1[df_addition1["4"].notna()]
df_addition1.rename(columns={"3": "1", "4": "2"}, inplace = True)
df_addition1

        1      2
4      r2     f3
13     m2     o2
25     f1     f2
33     s3   z1w#
34     f3     z1
...    ..    ...
19299  b2     s3
19301  m2   o-1*
19312  f2     b2
19318  l2  o=1d@
19319  b3     b2

[2230 rows x 2 columns]

In [622]:
df_addition2 = df_serving_1st[["5", "6"]]
df_addition2 = df_addition2[df_addition2["5"].notna()]
df_addition2 = df_addition2[df_addition2["6"].notna()]
df_addition2.rename(columns={"5": "1", "6": "2"}, inplace = True)
df_addition2

        1     2
4      b3    f2
13     b2  f3w@
25     b2    f1
34     l3   o3*
44     b2    f3
...    ..   ...
19286  f3   b+3
19295  s2    f3
19299  f3  b2d#
19312  f1    f2
19319  f3    b3

[1409 rows x 2 columns]

In [623]:
df_addition3 = df_serving_1st[["7", "8"]]
df_addition3 = df_addition3[df_addition3["7"].notna()]
df_addition3 = df_addition3[df_addition3["8"].notna()]
df_addition3.rename(columns={"7": "1", "8": "2"}, inplace = True)
df_addition3

        1     2
4      f1    f1
25     f2   f+1
44     m2    o3
45     f3   b+3
87     l3   o1*
...    ..   ...
19285  f1   f+3
19286  b3  z1w@
19295  b3    b2
19312  b3    b3
19319  s3    f3

[880 rows x 2 columns]

In [624]:
df_addition4 = df_serving_1st[["9", "10"]]
df_addition4 = df_addition4[df_addition4["9"].notna()]
df_addition4 = df_addition4[df_addition4["10"].notna()]
df_addition4.rename(columns={"9": "1", "10": "2"}, inplace = True)
df_addition4

        1     2
4      f3    b3
25     f2    z3
44     l2   v1*
194    f1    r2
233    b2    f1
...    ..   ...
19263  f3    s3
19285  m2  o-1*
19295  f1    f1
19312  b3    b2
19319  b3    f3

[544 rows x 2 columns]

In [625]:
df_serving_1st_all_shot_pairs = pd.concat([df_serving_1st_all_shot_pairs, df_addition1, df_addition2, df_addition3, df_addition4], ignore_index = True)
df_serving_1st_all_shot_pairs
#df3 = df1.append(df2, ignore_index=True)

        1     2
0     r28    f1
1     r37   b+3
2     r28    f1
3     b39    b2
4     f17   f+3
...   ...   ...
8710   f3    s3
8711   m2  o-1*
8712   f1    f1
8713   b3    b2
8714   b3    f3

[8715 rows x 2 columns]

In [626]:
# When the opponent played in dir 1:
df_serving_1st_oppo_dir1 = df_serving_1st_all_shot_pairs.loc[df_serving_1st_all_shot_pairs["1"].str.contains("1", case = True)]
len(df_serving_1st_oppo_dir1)

1666

In [627]:
df_serving_1st_oppo_dir2 = df_serving_1st_all_shot_pairs.loc[df_serving_1st_all_shot_pairs["1"].str.contains("2", case = True)]
len(df_serving_1st_oppo_dir2)

3876

In [628]:
df_serving_1st_oppo_dir3 = df_serving_1st_all_shot_pairs.loc[df_serving_1st_all_shot_pairs["1"].str.contains("3", case = True)]
len(df_serving_1st_oppo_dir3)

3062

In [629]:
df_serving_1st_oppo_dir1_djoko_dir1 = df_serving_1st_oppo_dir1.loc[df_serving_1st_oppo_dir1["2"].str.contains("1", case = True)]
len(df_serving_1st_oppo_dir1_djoko_dir1)

651

In [630]:
df_serving_1st_oppo_dir1_djoko_dir2 = df_serving_1st_oppo_dir1.loc[df_serving_1st_oppo_dir1["2"].str.contains("2", case = True)]
len(df_serving_1st_oppo_dir1_djoko_dir2)

421

In [631]:
df_serving_1st_oppo_dir1_djoko_dir3 = df_serving_1st_oppo_dir1.loc[df_serving_1st_oppo_dir1["2"].str.contains("3", case = True)]
len(df_serving_1st_oppo_dir1_djoko_dir3)

579

In [632]:
len(df_serving_1st_oppo_dir1_djoko_dir1.loc[df_serving_1st_oppo_dir1_djoko_dir1["2"].str.contains("q", case = True)])

0

In [633]:
len(df_serving_1st_oppo_dir1_djoko_dir2.loc[df_serving_1st_oppo_dir1_djoko_dir2["2"].str.contains("q", case = True)])

0

In [634]:
len(df_serving_1st_oppo_dir1_djoko_dir3.loc[df_serving_1st_oppo_dir1_djoko_dir3["2"].str.contains("q", case = True)])

0

In [635]:

df_serving_1st_oppo_dir1_djoko_dir1["2"] = df_serving_1st_oppo_dir1_djoko_dir1["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir1_djoko_dir1.loc[df_serving_1st_oppo_dir1_djoko_dir1["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\525225152.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir1_djoko_dir1["2"] = df_serving_1st_oppo_dir1_djoko_dir1["2"].str.replace('*', 'a')

80

In [636]:

df_serving_1st_oppo_dir1_djoko_dir2["2"] = df_serving_1st_oppo_dir1_djoko_dir2["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir1_djoko_dir2.loc[df_serving_1st_oppo_dir1_djoko_dir2["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1808784664.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir1_djoko_dir2["2"] = df_serving_1st_oppo_dir1_djoko_dir2["2"].str.replace('*', 'a')

10

In [637]:

df_serving_1st_oppo_dir1_djoko_dir3["2"] = df_serving_1st_oppo_dir1_djoko_dir3["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir1_djoko_dir3.loc[df_serving_1st_oppo_dir1_djoko_dir3["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2557179188.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir1_djoko_dir3["2"] = df_serving_1st_oppo_dir1_djoko_dir3["2"].str.replace('*', 'a')

69

In [638]:
df_serving_1st_oppo_dir2_djoko_dir_1 = df_serving_1st_oppo_dir2.loc[df_serving_1st_oppo_dir2["2"].str.contains("1", case = True)]
len(df_serving_1st_oppo_dir2_djoko_dir_1)

1442

In [639]:
df_serving_1st_oppo_dir2_djoko_dir_2 = df_serving_1st_oppo_dir2.loc[df_serving_1st_oppo_dir2["2"].str.contains("2", case = True)]
len(df_serving_1st_oppo_dir2_djoko_dir_2)

782

In [640]:
df_serving_1st_oppo_dir2_djoko_dir_3 = df_serving_1st_oppo_dir2.loc[df_serving_1st_oppo_dir2["2"].str.contains("3", case = True)]
len(df_serving_1st_oppo_dir2_djoko_dir_3)

1646

In [641]:
len(df_serving_1st_oppo_dir2_djoko_dir_1.loc[df_serving_1st_oppo_dir2_djoko_dir_1["2"].str.contains("q", case = True)])

0

In [642]:
len(df_serving_1st_oppo_dir2_djoko_dir_2.loc[df_serving_1st_oppo_dir2_djoko_dir_2["2"].str.contains("q", case = True)])

0

In [643]:
len(df_serving_1st_oppo_dir2_djoko_dir_3.loc[df_serving_1st_oppo_dir2_djoko_dir_3["2"].str.contains("q", case = True)])

0

In [644]:
df_serving_1st_oppo_dir2_djoko_dir_1["2"] = df_serving_1st_oppo_dir2_djoko_dir_1["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir2_djoko_dir_1.loc[df_serving_1st_oppo_dir2_djoko_dir_1["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2629296103.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir2_djoko_dir_1["2"] = df_serving_1st_oppo_dir2_djoko_dir_1["2"].str.replace('*', 'a')

256

In [645]:
df_serving_1st_oppo_dir2_djoko_dir_2["2"] = df_serving_1st_oppo_dir2_djoko_dir_2["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir2_djoko_dir_2.loc[df_serving_1st_oppo_dir2_djoko_dir_2["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2989285210.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir2_djoko_dir_2["2"] = df_serving_1st_oppo_dir2_djoko_dir_2["2"].str.replace('*', 'a')

15

In [646]:
df_serving_1st_oppo_dir2_djoko_dir_3["2"] = df_serving_1st_oppo_dir2_djoko_dir_3["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir2_djoko_dir_3.loc[df_serving_1st_oppo_dir2_djoko_dir_3["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3308234143.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir2_djoko_dir_3["2"] = df_serving_1st_oppo_dir2_djoko_dir_3["2"].str.replace('*', 'a')

164

In [647]:
df_serving_1st_oppo_dir3

        1    2
1     r37  b+3
3     b39   b2
6     r38   b3
7     r38   f3
8     s37  b+3
...   ...  ...
8706  b+3   s#
8707   b3   b3
8710   f3   s3
8713   b3   b2
8714   b3   f3

[3062 rows x 2 columns]

In [648]:
df_serving_1st_oppo_dir3_djoko_dir_1 = df_serving_1st_oppo_dir3.loc[df_serving_1st_oppo_dir3["2"].str.contains("1", case = True)]
len(df_serving_1st_oppo_dir3_djoko_dir_1)

934

In [649]:
df_serving_1st_oppo_dir3_djoko_dir_2 = df_serving_1st_oppo_dir3.loc[df_serving_1st_oppo_dir3["2"].str.contains("2", case = True)]
len(df_serving_1st_oppo_dir3_djoko_dir_2)

602

In [650]:
df_serving_1st_oppo_dir3_djoko_dir_3 = df_serving_1st_oppo_dir3.loc[df_serving_1st_oppo_dir3["2"].str.contains("3", case = True)]
len(df_serving_1st_oppo_dir3_djoko_dir_3)

1511

In [651]:
len(df_serving_1st_oppo_dir3_djoko_dir_1.loc[df_serving_1st_oppo_dir3_djoko_dir_1["2"].str.contains("9", case = True)])

47

In [652]:
len(df_serving_1st_oppo_dir3_djoko_dir_2.loc[df_serving_1st_oppo_dir3_djoko_dir_2["2"].str.contains("9", case = True)])

60

In [653]:
len(df_serving_1st_oppo_dir3_djoko_dir_3.loc[df_serving_1st_oppo_dir3_djoko_dir_3["2"].str.contains("9", case = True)])

100

In [654]:
df_serving_1st_oppo_dir3_djoko_dir_1["2"] = df_serving_1st_oppo_dir3_djoko_dir_1["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir3_djoko_dir_1.loc[df_serving_1st_oppo_dir3_djoko_dir_1["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\284337065.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir3_djoko_dir_1["2"] = df_serving_1st_oppo_dir3_djoko_dir_1["2"].str.replace('*', 'a')

160

In [655]:
df_serving_1st_oppo_dir3_djoko_dir_2["2"] = df_serving_1st_oppo_dir3_djoko_dir_2["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir3_djoko_dir_2.loc[df_serving_1st_oppo_dir3_djoko_dir_2["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1624933272.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir3_djoko_dir_2["2"] = df_serving_1st_oppo_dir3_djoko_dir_2["2"].str.replace('*', 'a')

15

In [656]:
df_serving_1st_oppo_dir3_djoko_dir_3["2"] = df_serving_1st_oppo_dir3_djoko_dir_3["2"].str.replace('*', 'a')
len(df_serving_1st_oppo_dir3_djoko_dir_3.loc[df_serving_1st_oppo_dir3_djoko_dir_3["2"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\598932994.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_1st_oppo_dir3_djoko_dir_3["2"] = df_serving_1st_oppo_dir3_djoko_dir_3["2"].str.replace('*', 'a')

97

In [657]:
# When Djokovic is opening the ralley with a second serve we have to look at Djokos Shots: "3", "5", "7" and so on
df_serving_2nd

,Pts,Gm1,Gm2,Set1,Set2,Serving,0,1,2,3,...,44,45,46,47,48,49,50,51,52,53
0,0-0,0,0,0,0,ND,"4n,",4,f18,f3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,0-15,0,0,0,0,ND,"4n,",6,f2n#,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,30-15,0,0,0,0,ND,"4n,",5,b3n@,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,0-15,1,1,0,0,ND,"4n,",5,b28,f3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,0-30,1,1,0,0,ND,"4d,",6,b28,f2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19300,40-40,2,3,1,1,ND,"6n,",4,f27,b2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19303,AD-40,2,3,1,1,ND,"4x,",6,f39,b3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19320,0-30,5,4,1,1,ND,"6w,",5,b39,b2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19322,30-30,5,4,1,1,ND,"4d,",4,f19,f3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19323,40-30,5,4,1,1,ND,"6n,",5,f39,b2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [658]:
df_serving_2nd_all_shot_pairs = df_serving_2nd[["2", "3"]]
df_serving_2nd_all_shot_pairs = df_serving_2nd_all_shot_pairs[df_serving_2nd_all_shot_pairs['2'].notna()]
df_serving_2nd_all_shot_pairs

          2    3
0       f18   f3
1      f2n#  NaN
3      b3n@  NaN
14      b28   f3
15      b28   f2
...     ...  ...
19300   f27   b2
19303   f39   b3
19320   b39   b2
19322   f19   f3
19323   f39   b2

[2845 rows x 2 columns]

In [659]:
df_addition1_1 = df_serving_2nd[["4", "5"]]
df_addition1_1 = df_addition1_1[df_addition1_1["4"].notna()]
df_addition1_1 = df_addition1_1[df_addition1_1["5"].notna()]
df_addition1_1.rename(columns={"4": "2", "5": "3"}, inplace = True)
df_addition1_1

        2    3
0      s2   f1
14     b2   f3
15     f1   f1
23     b1  f1*
53     b2   f1
...    ..  ...
19300  s3   s3
19303  s3   f3
19320  b2   f3
19322  b3   b3
19323  f3   b1

[1674 rows x 2 columns]

In [660]:
df_addition1_2 = df_serving_2nd[["6", "7"]]
df_addition1_2 = df_addition1_2[df_addition1_2["6"].notna()]
df_addition1_2 = df_addition1_2[df_addition1_2["7"].notna()]
df_addition1_2.rename(columns={"6": "2", "7": "3"}, inplace = True)
df_addition1_2

        2     3
0      f3  b3n@
14     b3    f2
15     f3    b3
53     f1    f3
66     f1  h3n#
...    ..   ...
19300  s3    b2
19303  s3    f3
19320  b3    b3
19322  b1    f2
19323  f1    f1

[1117 rows x 2 columns]

In [661]:
df_addition1_3 = df_serving_2nd[["8", "9"]]
df_addition1_3 = df_addition1_3[df_addition1_3["8"].notna()]
df_addition1_3 = df_addition1_3[df_addition1_3["9"].notna()]
df_addition1_3.rename(columns={"8": "2", "9": "3"}, inplace = True)
df_addition1_3

        2     3
14     f2    f3
15     b3    b2
85     b2    f3
96     f1  f3w@
97     f3    b2
...    ..   ...
19300  b1  f2n@
19303  s3    f1
19320  s3    b3
19322  b3    s3
19323  f2    b3

[734 rows x 2 columns]

In [662]:
df_addition1_4 = df_serving_2nd[["10", "11"]]
df_addition1_4 = df_addition1_4[df_addition1_4["10"].notna()]
df_addition1_4 = df_addition1_4[df_addition1_4["11"].notna()]
df_addition1_4.rename(columns={"10": "2", "11": "3"}, inplace = True)
df_addition1_4

        2   3
14     s1  f1
85     b3  b3
97     f3  b3
110    b3  b3
134    f1  f2
...    ..  ..
19277  f1  f3
19287  s2  f3
19320  b3  b3
19322  f3  b3
19323  b2  b1

[514 rows x 2 columns]

In [663]:
df_addition1_5 = df_serving_2nd[["12", "13"]]
df_addition1_5 = df_addition1_5[df_addition1_5["12"].notna()]
df_addition1_5 = df_addition1_5[df_addition1_5["13"].notna()]
df_addition1_5.rename(columns={"12": "2", "13": "3"}, inplace = True)
df_addition1_5

        2   3
14     f1  f3
85     f2  b3
97     b3  b3
110    b3  b3
175    f1  f2
...    ..  ..
19277  s2  f1
19287  b3  b2
19320  b3  s3
19322  b3  b2
19323  f1  f1

[358 rows x 2 columns]

In [664]:
df_serving_2nd_all_shot_pairs = pd.concat([df_serving_2nd_all_shot_pairs, df_addition1_1, df_addition1_2, df_addition1_3, df_addition1_4, df_addition1_5], ignore_index = True)
df_serving_2nd_all_shot_pairs

         2    3
0      f18   f3
1     f2n#  NaN
2     b3n@  NaN
3      b28   f3
4      b28   f2
...    ...  ...
7237    s2   f1
7238    b3   b2
7239    b3   s3
7240    b3   b2
7241    f1   f1

[7242 rows x 2 columns]

In [665]:
# When the opponent played in dir 1:
df_serving_2nd_oppo_dir1 = df_serving_2nd_all_shot_pairs.loc[df_serving_2nd_all_shot_pairs["2"].str.contains("1", case = True)]
len(df_serving_2nd_oppo_dir1)

1538

In [666]:
df_serving_2nd_oppo_dir2 = df_serving_2nd_all_shot_pairs.loc[df_serving_2nd_all_shot_pairs["2"].str.contains("2", case = True)]
len(df_serving_2nd_oppo_dir2)

2741

In [667]:
df_serving_2nd_oppo_dir3 = df_serving_2nd_all_shot_pairs.loc[df_serving_2nd_all_shot_pairs["2"].str.contains("3", case = True)]
len(df_serving_2nd_oppo_dir3)

2871

In [668]:
df_serving_2nd_oppo_dir1 = df_serving_2nd_oppo_dir1[df_serving_2nd_oppo_dir1["3"].notna()]
df_serving_2nd_oppo_dir2 = df_serving_2nd_oppo_dir2[df_serving_2nd_oppo_dir2["3"].notna()]
df_serving_2nd_oppo_dir3 = df_serving_2nd_oppo_dir3[df_serving_2nd_oppo_dir3["3"].notna()]

In [669]:
len(df_serving_2nd_oppo_dir1), len(df_serving_2nd_oppo_dir2), len(df_serving_2nd_oppo_dir3)

(1414, 2591, 2710)

In [670]:
df_serving_2nd_oppo_dir1_djoko_dir1 = df_serving_2nd_oppo_dir1.loc[df_serving_2nd_oppo_dir1["3"].str.contains("1", case = True)]
len(df_serving_2nd_oppo_dir1_djoko_dir1)

587

In [671]:
df_serving_2nd_oppo_dir1_djoko_dir2 = df_serving_2nd_oppo_dir1.loc[df_serving_2nd_oppo_dir1["3"].str.contains("2", case = True)]
len(df_serving_2nd_oppo_dir1_djoko_dir2)

383

In [672]:
df_serving_2nd_oppo_dir1_djoko_dir3 = df_serving_2nd_oppo_dir1.loc[df_serving_2nd_oppo_dir1["3"].str.contains("3", case = True)]
len(df_serving_2nd_oppo_dir1_djoko_dir3)

433

In [673]:
len(df_serving_2nd_oppo_dir1_djoko_dir1.loc[df_serving_2nd_oppo_dir1_djoko_dir1["3"].str.contains("q", case = True)])

0

In [674]:
len(df_serving_2nd_oppo_dir1_djoko_dir2.loc[df_serving_2nd_oppo_dir1_djoko_dir2["3"].str.contains("q", case = True)])

0

In [675]:
len(df_serving_2nd_oppo_dir1_djoko_dir3.loc[df_serving_2nd_oppo_dir1_djoko_dir3["3"].str.contains("q", case = True)])

0

In [676]:
df_serving_2nd_oppo_dir1_djoko_dir1["3"] = df_serving_2nd_oppo_dir1_djoko_dir1["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir1_djoko_dir1.loc[df_serving_2nd_oppo_dir1_djoko_dir1["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\783007518.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir1_djoko_dir1["3"] = df_serving_2nd_oppo_dir1_djoko_dir1["3"].str.replace('*', 'a')

36

In [677]:
df_serving_2nd_oppo_dir1_djoko_dir2["3"] = df_serving_2nd_oppo_dir1_djoko_dir2["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir1_djoko_dir2.loc[df_serving_2nd_oppo_dir1_djoko_dir2["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\34451558.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir1_djoko_dir2["3"] = df_serving_2nd_oppo_dir1_djoko_dir2["3"].str.replace('*', 'a')

9

In [678]:
df_serving_2nd_oppo_dir1_djoko_dir3["3"] = df_serving_2nd_oppo_dir1_djoko_dir3["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir1_djoko_dir3.loc[df_serving_2nd_oppo_dir1_djoko_dir3["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2792775502.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir1_djoko_dir3["3"] = df_serving_2nd_oppo_dir1_djoko_dir3["3"].str.replace('*', 'a')

32

In [679]:
df_serving_2nd_oppo_dir2

        2    3
3     b28   f3
4     b28   f2
5     f28   f2
7     b27   f3
8     f28   f3
...   ...  ...
7207   b2   f1
7209   r2   b3
7226   f2   f3
7228   r2  f+3
7237   s2   f1

[2591 rows x 2 columns]

In [680]:
df_serving_2nd_oppo_dir2_djoko_dir1 = df_serving_2nd_oppo_dir2.loc[df_serving_2nd_oppo_dir2["3"].str.contains("1", case = True)]
len(df_serving_2nd_oppo_dir2_djoko_dir1)

758

In [681]:
df_serving_2nd_oppo_dir2_djoko_dir2 = df_serving_2nd_oppo_dir2.loc[df_serving_2nd_oppo_dir2["3"].str.contains("2", case = True)]
len(df_serving_2nd_oppo_dir2_djoko_dir2)

734

In [682]:
df_serving_2nd_oppo_dir2_djoko_dir3 = df_serving_2nd_oppo_dir2.loc[df_serving_2nd_oppo_dir2["3"].str.contains("3", case = True)]
len(df_serving_2nd_oppo_dir2_djoko_dir3)

1094

In [683]:
len(df_serving_2nd_oppo_dir2_djoko_dir1.loc[df_serving_2nd_oppo_dir2_djoko_dir1["3"].str.contains("q", case = True)])

0

In [684]:
len(df_serving_2nd_oppo_dir2_djoko_dir2.loc[df_serving_2nd_oppo_dir2_djoko_dir2["3"].str.contains("q", case = True)])

0

In [685]:
len(df_serving_2nd_oppo_dir2_djoko_dir3.loc[df_serving_2nd_oppo_dir2_djoko_dir3["3"].str.contains("q", case = True)])

0

In [686]:
df_serving_2nd_oppo_dir2_djoko_dir1["3"] = df_serving_2nd_oppo_dir2_djoko_dir1["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir2_djoko_dir1.loc[df_serving_2nd_oppo_dir2_djoko_dir1["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\492761547.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir2_djoko_dir1["3"] = df_serving_2nd_oppo_dir2_djoko_dir1["3"].str.replace('*', 'a')

68

In [687]:
df_serving_2nd_oppo_dir2_djoko_dir2["3"] = df_serving_2nd_oppo_dir2_djoko_dir2["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir2_djoko_dir2.loc[df_serving_2nd_oppo_dir2_djoko_dir2["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\558656244.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir2_djoko_dir2["3"] = df_serving_2nd_oppo_dir2_djoko_dir2["3"].str.replace('*', 'a')

2

In [688]:
df_serving_2nd_oppo_dir2_djoko_dir3["3"] = df_serving_2nd_oppo_dir2_djoko_dir3["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir2_djoko_dir3.loc[df_serving_2nd_oppo_dir2_djoko_dir3["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1590072969.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir2_djoko_dir3["3"] = df_serving_2nd_oppo_dir2_djoko_dir3["3"].str.replace('*', 'a')

67

In [689]:
df_serving_2nd_oppo_dir3

        2     3
10    f38    b3
17    b38    b2
24    f38    b1
25    b38    b3
52    b38   b+1
...   ...   ...
7235   f3    b3
7236  o-3  b3n#
7238   b3    b2
7239   b3    s3
7240   b3    b2

[2710 rows x 2 columns]

In [690]:
df_serving_2nd_oppo_dir3_djoko_dir1 = df_serving_2nd_oppo_dir3.loc[df_serving_2nd_oppo_dir3["3"].str.contains("1", case = True)]
len(df_serving_2nd_oppo_dir3_djoko_dir1)

625

In [691]:
df_serving_2nd_oppo_dir3_djoko_dir2 = df_serving_2nd_oppo_dir3.loc[df_serving_2nd_oppo_dir3["3"].str.contains("2", case = True)]
len(df_serving_2nd_oppo_dir3_djoko_dir2)

623

In [692]:
df_serving_2nd_oppo_dir3_djoko_dir3 = df_serving_2nd_oppo_dir3.loc[df_serving_2nd_oppo_dir3["3"].str.contains("3", case = True)]
len(df_serving_2nd_oppo_dir3_djoko_dir3)

1450

In [693]:
len(df_serving_2nd_oppo_dir3_djoko_dir1.loc[df_serving_2nd_oppo_dir3_djoko_dir1["3"].str.contains("q", case = True)])

0

In [694]:
len(df_serving_2nd_oppo_dir3_djoko_dir2.loc[df_serving_2nd_oppo_dir3_djoko_dir2["3"].str.contains("q", case = True)])

0

In [695]:
len(df_serving_2nd_oppo_dir3_djoko_dir3.loc[df_serving_2nd_oppo_dir3_djoko_dir3["3"].str.contains("q", case = True)])

0

In [696]:
df_serving_2nd_oppo_dir3_djoko_dir1["3"] = df_serving_2nd_oppo_dir3_djoko_dir1["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir3_djoko_dir1.loc[df_serving_2nd_oppo_dir3_djoko_dir1["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3458801919.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir3_djoko_dir1["3"] = df_serving_2nd_oppo_dir3_djoko_dir1["3"].str.replace('*', 'a')

83

In [697]:
df_serving_2nd_oppo_dir3_djoko_dir2["3"] = df_serving_2nd_oppo_dir3_djoko_dir2["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir3_djoko_dir2.loc[df_serving_2nd_oppo_dir3_djoko_dir2["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3049166286.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir3_djoko_dir2["3"] = df_serving_2nd_oppo_dir3_djoko_dir2["3"].str.replace('*', 'a')

2

In [698]:
df_serving_2nd_oppo_dir3_djoko_dir3["3"] = df_serving_2nd_oppo_dir3_djoko_dir3["3"].str.replace('*', 'a')
len(df_serving_2nd_oppo_dir3_djoko_dir3.loc[df_serving_2nd_oppo_dir3_djoko_dir3["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1927008624.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_serving_2nd_oppo_dir3_djoko_dir3["3"] = df_serving_2nd_oppo_dir3_djoko_dir3["3"].str.replace('*', 'a')

40

In [699]:
df_returning_1st

,Pts,Gm1,Gm2,Set1,Set2,Serving,0,1,2,3,...,44,45,46,47,48,49,50,51,52,53
10,30-40,1,0,0,0,CR,6,f37,b3,b3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,40-40,1,0,0,0,CR,4,f3w#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,AD-40,1,0,0,0,CR,4,b38,f3*,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,0-0,2,1,0,0,CR,6,s38,u+1,r3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,15-0,2,1,0,0,CR,6,f1n#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19290,0-0,2,2,1,1,AM,4,r29,f1,r3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19291,15-0,2,2,1,1,AM,6,r29,f1,f2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19292,30-0,2,2,1,1,AM,4,f1d#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19307,0-40,3,3,1,1,AM,6,f38,b3,b2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19317,40-15,5,3,1,1,AM,5,b1d#,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [700]:
# Ralleys where Djokovic had to return a first serve. Shots to analyse: "3", "5", "7", "9"
df_returning_1st_all_shot_pairs = df_returning_1st[["2", "3"]]
df_returning_1st_all_shot_pairs = df_returning_1st_all_shot_pairs[df_returning_1st_all_shot_pairs['3'].notna()]
df_returning_1st_all_shot_pairs

         2   3
10      b3  b3
19     u+1  r3
28      f3  b1
37      b3  b3
39      b2  f3
...    ...  ..
19273   f3  b3
19284   b3  b1
19290   f1  r3
19291   f1  f2
19307   b3  b2

[2849 rows x 2 columns]

In [701]:
df_addition_return1 = df_returning_1st[["4", "5"]]
df_addition_return1 = df_addition_return1[df_addition_return1["4"].notna()]
df_addition_return1 = df_addition_return1[df_addition_return1["5"].notna()]
df_addition_return1.rename(columns={"4": "2", "5": "3"}, inplace = True)
df_addition_return1

         2     3
10      f3  s1w#
19      i3    z1
28      f2  f1w@
37      b3    b3
39      b2    f1
...    ...   ...
19273   b2    f3
19284   f1   f+3
19290   f3  b3n#
19291  f+3    s3
19307   f1    f3

[1799 rows x 2 columns]

In [702]:
df_addition_return2 = df_returning_1st[["6", "7"]]
df_addition_return2 = df_addition_return2[df_addition_return2["6"].notna()]
df_addition_return2 = df_addition_return2[df_addition_return2["7"].notna()]
df_addition_return2.rename(columns={"6": "2", "7": "3"}, inplace = True)
df_addition_return2

        2      3
37     b3     b3
43     b3     b2
51     b2     f3
63     f2     b2
82     r2     f1
...    ..    ...
19228  f1     f2
19238  f1   f3d@
19257  b3     b2
19273  b3     b1
19284  m2  o-2d@

[1150 rows x 2 columns]

In [703]:
df_addition_return3 = df_returning_1st[["8", "9"]]
df_addition_return3 = df_addition_return3[df_addition_return3["8"].notna()]
df_addition_return3 = df_addition_return3[df_addition_return3["9"].notna()]
df_addition_return3.rename(columns={"8": "2", "9": "3"}, inplace = True)
df_addition_return3

         2    3
37      f3   b3
43      b3   f3
51      b2   f1
63      b2   f3
82      f1  f+3
...    ...  ...
19208   f1   f1
19211  s-1   f2
19228   b1   f3
19257   b3   s2
19273   r1  f+1

[754 rows x 2 columns]

In [704]:
df_addition_return4 = df_returning_1st[["10", "11"]]
df_addition_return4 = df_addition_return4[df_addition_return4["10"].notna()]
df_addition_return4 = df_addition_return4[df_addition_return4["11"].notna()]
df_addition_return4.rename(columns={"10": "2", "11": "3"}, inplace = True)
df_addition_return4

        2     3
37     f3  b1w#
43     b3  b3n#
51     r3  b3d@
63     s3    f3
90     f2    f@
...    ..   ...
19156  b3    b2
19171  b3    b3
19208  f3  b1w@
19228  b3    b2
19257  f3    b2

[509 rows x 2 columns]

In [705]:
df_returning_1st_all_shot_pairs = pd.concat([df_returning_1st_all_shot_pairs, df_addition_return1, df_addition_return2, df_addition_return3, df_addition_return4], ignore_index = True)
df_returning_1st_all_shot_pairs

        2     3
0      b3    b3
1     u+1    r3
2      f3    b1
3      b3    b3
4      b2    f3
...   ...   ...
7056   b3    b2
7057   b3    b3
7058   f3  b1w@
7059   b3    b2
7060   f3    b2

[7061 rows x 2 columns]

In [706]:
df_returning_1st_oppo_dir1 = df_returning_1st_all_shot_pairs.loc[df_returning_1st_all_shot_pairs["2"].str.contains("1", case = True)]
df_returning_1st_oppo_dir1

        2     3
1     u+1    r3
7      f1  f3w#
8      f1    f1
12     f1    f1
16    f+1    f2
...   ...   ...
7038   b1    f1
7040   f1    f2
7044   f1    f1
7054   f1  f1w@
7055   b1    f1

[2001 rows x 2 columns]

In [707]:
df_returning_1st_oppo_dir2 = df_returning_1st_all_shot_pairs.loc[df_returning_1st_all_shot_pairs["2"].str.contains("2", case = True)]
df_returning_1st_oppo_dir2

       2    3
4     b2   f3
6     b2   b2
10    f2   f1
13    b2   b3
15    b2   f1
...   ..  ...
7045  b2   s2
7046  b2   s3
7048  b2   f2
7051  b2   f3
7053  l2  o1*

[1924 rows x 2 columns]

In [708]:
df_returning_1st_oppo_dir3 = df_returning_1st_all_shot_pairs.loc[df_returning_1st_all_shot_pairs["2"].str.contains("3", case = True)]
df_returning_1st_oppo_dir3

        2     3
0      b3    b3
2      f3    b1
3      b3    b3
5     f+3    m2
9     f+3    s3
...   ...   ...
7056   b3    b2
7057   b3    b3
7058   f3  b1w@
7059   b3    b2
7060   f3    b2

[3054 rows x 2 columns]

In [709]:
df_returning_1st_oppo_dir1_djoko_dir1 = df_returning_1st_oppo_dir1.loc[df_returning_1st_oppo_dir1["3"].str.contains("1", case=True)]
df_returning_1st_oppo_dir1_djoko_dir1

       2     3
8     f1    f1
12    f1    f1
25    f1    f1
45    f1  f1d@
51    f1    f1
...   ..   ...
7035  b1    f1
7038  b1    f1
7044  f1    f1
7054  f1  f1w@
7055  b1    f1

[868 rows x 2 columns]

In [710]:
df_returning_1st_oppo_dir1_djoko_dir2 = df_returning_1st_oppo_dir1.loc[df_returning_1st_oppo_dir1["3"].str.contains("2", case=True)]
df_returning_1st_oppo_dir1_djoko_dir2

        2   3
16    f+1  f2
17     b1  f2
21     f1  f2
23     b1  r2
24     f1  f2
...   ...  ..
6977   b1  r2
6978   f1  f2
6989   f1  f2
7016  f;1  r2
7040   f1  f2

[576 rows x 2 columns]

In [711]:
df_returning_1st_oppo_dir1_djoko_dir3 = df_returning_1st_oppo_dir1.loc[df_returning_1st_oppo_dir1["3"].str.contains("3", case=True)]
df_returning_1st_oppo_dir1_djoko_dir3

        2     3
1     u+1    r3
7      f1  f3w#
56    y-1   f-3
89     f1   f3*
103   y+1   r3*
...   ...   ...
6974   f1    f3
6980   f1   f+3
6985   f1    f3
7004   b1    f3
7022   b1    f3

[538 rows x 2 columns]

In [712]:
len(df_returning_1st_oppo_dir1_djoko_dir1.loc[df_returning_1st_oppo_dir1_djoko_dir1["3"].str.contains("q", case = True)])

0

In [713]:
len(df_returning_1st_oppo_dir1_djoko_dir2.loc[df_returning_1st_oppo_dir1_djoko_dir2["3"].str.contains("q", case = True)])

1

In [714]:
len(df_returning_1st_oppo_dir1_djoko_dir3.loc[df_returning_1st_oppo_dir1_djoko_dir3["3"].str.contains("q", case = True)])

0

In [715]:
df_returning_1st_oppo_dir1_djoko_dir1["3"] = df_returning_1st_oppo_dir1_djoko_dir1["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir1_djoko_dir1.loc[df_returning_1st_oppo_dir1_djoko_dir1["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3039495190.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir1_djoko_dir1["3"] = df_returning_1st_oppo_dir1_djoko_dir1["3"].str.replace('*', 'a')

46

In [716]:
df_returning_1st_oppo_dir1_djoko_dir2["3"] = df_returning_1st_oppo_dir1_djoko_dir2["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir1_djoko_dir2.loc[df_returning_1st_oppo_dir1_djoko_dir2["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3065280467.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir1_djoko_dir2["3"] = df_returning_1st_oppo_dir1_djoko_dir2["3"].str.replace('*', 'a')

3

In [717]:
df_returning_1st_oppo_dir1_djoko_dir3["3"] = df_returning_1st_oppo_dir1_djoko_dir3["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir1_djoko_dir3.loc[df_returning_1st_oppo_dir1_djoko_dir3["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\547332222.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir1_djoko_dir3["3"] = df_returning_1st_oppo_dir1_djoko_dir3["3"].str.replace('*', 'a')

43

In [718]:
df_returning_1st_oppo_dir2

       2    3
4     b2   f3
6     b2   b2
10    f2   f1
13    b2   b3
15    b2   f1
...   ..  ...
7045  b2   s2
7046  b2   s3
7048  b2   f2
7051  b2   f3
7053  l2  o1*

[1924 rows x 2 columns]

In [719]:
df_returning_1st_oppo_dir2_djoko_dir1 = df_returning_1st_oppo_dir2.loc[df_returning_1st_oppo_dir2["3"].str.contains("1", case=True)]
df_returning_1st_oppo_dir2_djoko_dir1

        2    3
10     f2   f1
15     b2   f1
37     b2   f1
47     b2   s1
54     b2   f1
...   ...  ...
7013  f;2   f1
7026   f2   f1
7027   f2   s1
7028   s2  f+1
7053   l2  o1*

[608 rows x 2 columns]

In [720]:
df_returning_1st_oppo_dir2_djoko_dir2 = df_returning_1st_oppo_dir2.loc[df_returning_1st_oppo_dir2["3"].str.contains("2", case=True)]
df_returning_1st_oppo_dir2_djoko_dir2

       2   3
6     b2  b2
28    f2  f2
31    b2  s2
35    f2  f2
42    f2  b2
...   ..  ..
6929  s2  s2
6931  b2  f2
7020  b2  b2
7045  b2  s2
7048  b2  f2

[603 rows x 2 columns]

In [721]:
df_returning_1st_oppo_dir2_djoko_dir3 = df_returning_1st_oppo_dir2.loc[df_returning_1st_oppo_dir2["3"].str.contains("3", case=True)]
df_returning_1st_oppo_dir2_djoko_dir3

       2    3
4     b2   f3
13    b2   b3
36    b2  s+3
52    f2   f3
60    f2   b3
...   ..  ...
7023  b2   f3
7024  b2   b3
7025  b2   f3
7046  b2   s3
7051  b2   f3

[703 rows x 2 columns]

In [722]:
len(df_returning_1st_oppo_dir2_djoko_dir1.loc[df_returning_1st_oppo_dir2_djoko_dir1["3"].str.contains("q", case = True)])

0

In [723]:
len(df_returning_1st_oppo_dir2_djoko_dir2.loc[df_returning_1st_oppo_dir2_djoko_dir2["3"].str.contains("q", case = True)])

0

In [724]:
len(df_returning_1st_oppo_dir2_djoko_dir3.loc[df_returning_1st_oppo_dir2_djoko_dir3["3"].str.contains("q", case = True)])

0

In [725]:
df_returning_1st_oppo_dir2_djoko_dir1["3"] = df_returning_1st_oppo_dir2_djoko_dir1["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir2_djoko_dir1.loc[df_returning_1st_oppo_dir2_djoko_dir1["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\923527657.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir2_djoko_dir1["3"] = df_returning_1st_oppo_dir2_djoko_dir1["3"].str.replace('*', 'a')

54

In [726]:
df_returning_1st_oppo_dir2_djoko_dir2["3"] = df_returning_1st_oppo_dir2_djoko_dir2["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir2_djoko_dir2.loc[df_returning_1st_oppo_dir2_djoko_dir2["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\4125201412.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir2_djoko_dir2["3"] = df_returning_1st_oppo_dir2_djoko_dir2["3"].str.replace('*', 'a')

6

In [727]:
df_returning_1st_oppo_dir2_djoko_dir3["3"] = df_returning_1st_oppo_dir2_djoko_dir3["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir2_djoko_dir3.loc[df_returning_1st_oppo_dir2_djoko_dir3["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\318080214.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir2_djoko_dir3["3"] = df_returning_1st_oppo_dir2_djoko_dir3["3"].str.replace('*', 'a')

45

In [728]:
df_returning_1st_oppo_dir3

        2     3
0      b3    b3
2      f3    b1
3      b3    b3
5     f+3    m2
9     f+3    s3
...   ...   ...
7056   b3    b2
7057   b3    b3
7058   f3  b1w@
7059   b3    b2
7060   f3    b2

[3054 rows x 2 columns]

In [729]:
df_returning_1st_oppo_dir3_djoko_dir1 = df_returning_1st_oppo_dir3.loc[df_returning_1st_oppo_dir3["3"].str.contains("1", case=True)]
df_returning_1st_oppo_dir3_djoko_dir1

        2     3
2      f3    b1
14     f3    b1
18    b+3  s1w#
26     b3  b1n@
33     b3  b1w#
...   ...   ...
7015   b3    s1
7039   f3  b1x@
7041   f3    b1
7047   s3    b1
7058   f3  b1w@

[695 rows x 2 columns]

In [730]:
df_returning_1st_oppo_dir3_djoko_dir2 = df_returning_1st_oppo_dir3.loc[df_returning_1st_oppo_dir3["3"].str.contains("2", case=True)]
df_returning_1st_oppo_dir3_djoko_dir2

        2   3
5     f+3  m2
20     b3  s2
40     b3  s2
48     f3  b2
57     f3  b2
...   ...  ..
7043   b3  b2
7052   f3  b2
7056   b3  b2
7059   b3  b2
7060   f3  b2

[786 rows x 2 columns]

In [731]:
df_returning_1st_oppo_dir3_djoko_dir3 = df_returning_1st_oppo_dir3.loc[df_returning_1st_oppo_dir3["3"].str.contains("3", case=True)]
df_returning_1st_oppo_dir3_djoko_dir3

        2   3
0      b3  b3
3      b3  b3
9     f+3  s3
11     f3  b3
19     f3  b3
...   ...  ..
7036   f3  b3
7037   b3  b3
7049   f3  b3
7050   b3  b3
7057   b3  b3

[1535 rows x 2 columns]

In [732]:
len(df_returning_1st_oppo_dir3_djoko_dir1.loc[df_returning_1st_oppo_dir3_djoko_dir1["3"].str.contains("q", case = True)])

0

In [733]:
len(df_returning_1st_oppo_dir3_djoko_dir2.loc[df_returning_1st_oppo_dir3_djoko_dir2["3"].str.contains("q", case = True)])

0

In [734]:
len(df_returning_1st_oppo_dir3_djoko_dir3.loc[df_returning_1st_oppo_dir3_djoko_dir3["3"].str.contains("q", case = True)])

0

In [735]:
df_returning_1st_oppo_dir3_djoko_dir1["3"] = df_returning_1st_oppo_dir3_djoko_dir1["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir3_djoko_dir1.loc[df_returning_1st_oppo_dir3_djoko_dir1["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1879265300.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir3_djoko_dir1["3"] = df_returning_1st_oppo_dir3_djoko_dir1["3"].str.replace('*', 'a')

70

In [736]:
df_returning_1st_oppo_dir3_djoko_dir2["3"] = df_returning_1st_oppo_dir3_djoko_dir2["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir3_djoko_dir2.loc[df_returning_1st_oppo_dir3_djoko_dir2["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\21084923.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir3_djoko_dir2["3"] = df_returning_1st_oppo_dir3_djoko_dir2["3"].str.replace('*', 'a')

4

In [737]:
df_returning_1st_oppo_dir3_djoko_dir3["3"] = df_returning_1st_oppo_dir3_djoko_dir3["3"].str.replace('*', 'a')
len(df_returning_1st_oppo_dir3_djoko_dir3.loc[df_returning_1st_oppo_dir3_djoko_dir3["3"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2861110505.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_1st_oppo_dir3_djoko_dir3["3"] = df_returning_1st_oppo_dir3_djoko_dir3["3"].str.replace('*', 'a')

47

In [738]:
# Relevant columns to analyse are: "4", "6", "8", "10"
df_returning_2nd

,Pts,Gm1,Gm2,Set1,Set2,Serving,0,1,2,3,...,44,45,46,47,48,49,50,51,52,53
5,0-0,1,0,0,0,CR,"4n,",6,b37,b2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,15-0,1,0,0,0,CR,"4n,",5,b38,s3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,15-15,1,0,0,0,CR,"6n,",5,f28,f3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,15-30,1,0,0,0,CR,"4d,",6,f38,f3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,15-40,1,0,0,0,CR,"6d,",5,b3w@,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19306,0-30,3,3,1,1,AM,"4w,",6,b38,b2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19313,0-0,5,3,1,1,AM,"6d,",5,b29,f3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19314,15-0,5,3,1,1,AM,"4d,",4,s3n#,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19315,30-0,5,3,1,1,AM,"6n,",6,b37,b3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19316,40-0,5,3,1,1,AM,"4n,",5,b18*,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [739]:
df_returning_2nd_all_shot_pairs = df_returning_2nd[["3", "4"]]
df_returning_2nd_all_shot_pairs = df_returning_2nd_all_shot_pairs[df_returning_2nd_all_shot_pairs['4'].notna()]
df_returning_2nd_all_shot_pairs

        3   4
5      b2  f3
6      s3  b3
7      f3  s2
8      f3  b2
38     f2  f1
...    ..  ..
19304  f3  b3
19305  b3  b1
19306  b2  b2
19313  f3  b2
19315  b3  b1

[2108 rows x 2 columns]

In [740]:
df_addition_return1_1 = df_returning_2nd[["5", "6"]]
df_addition_return1_1 = df_addition_return1_1[df_addition_return1_1["5"].notna()]
df_addition_return1_1 = df_addition_return1_1[df_addition_return1_1["6"].notna()]
df_addition_return1_1.rename(columns={"5": "3", "6": "4"}, inplace = True)
df_addition_return1_1

         3   4
5       s2  f1
6       b3  b3
7      f+3  b2
8       f1  f2
38      f3  b3
...    ...  ..
19304   b3  f3
19305   f2  f3
19306   b3  b3
19313   f1  r2
19315   f1  f3

[1453 rows x 2 columns]

In [741]:
df_addition_return1_2 = df_returning_2nd[["7", "8"]]
df_addition_return1_2 = df_addition_return1_2[df_addition_return1_2["7"].notna()]
df_addition_return1_2 = df_addition_return1_2[df_addition_return1_2["8"].notna()]
df_addition_return1_2.rename(columns={"7": "3", "8": "4"}, inplace = True)
df_addition_return1_2

        3     4
5      f1  f3w@
6      b3   b1*
38     s2    f1
61     s1    f1
62     f1    f1
...    ..   ...
19304  b3    s3
19305  s3    f1
19306  b3    b2
19313  f3    s2
19315  b2    f3

[986 rows x 2 columns]

In [742]:
df_addition_return1_3 = df_returning_2nd[["9", "10"]]
df_addition_return1_3 = df_addition_return1_3[df_addition_return1_3["9"].notna()]
df_addition_return1_3 = df_addition_return1_3[df_addition_return1_3["10"].notna()]
df_addition_return1_3.rename(columns={"9": "3", "10": "4"}, inplace = True)
df_addition_return1_3

        3     4
38     f2    f1
61     f1    f3
62     f2   b;3
80     r2   f+3
139    b3    s3
...    ..   ...
19304  b3    b3
19305  f3    b1
19306  b3    b3
19313  f1  f2d#
19315  b3    b1

[674 rows x 2 columns]

In [743]:
df_addition_return1_4 = df_returning_2nd[["11", "12"]]
df_addition_return1_4 = df_addition_return1_4[df_addition_return1_4["11"].notna()]
df_addition_return1_4 = df_addition_return1_4[df_addition_return1_4["12"].notna()]
df_addition_return1_4.rename(columns={"11": "3", "12": "4"}, inplace = True)
df_addition_return1_4

        3     4
38     f2    f2
61     s3    f3
139    b3    s3
146    b2    s1
148    f3  b1w@
...    ..   ...
19258  f3    b3
19275  b1    r2
19305  f1  f+3*
19306  b3    b3
19315  r1   u+3

[465 rows x 2 columns]

In [744]:
df_returning_2nd_all_shot_pairs = pd.concat([df_returning_2nd_all_shot_pairs, df_addition_return1_1, df_addition_return1_2, df_addition_return1_3, df_addition_return1_4], ignore_index = True)
df_returning_2nd_all_shot_pairs

       3     4
0     b2    f3
1     s3    b3
2     f3    s2
3     f3    b2
4     f2    f1
...   ..   ...
5681  f3    b3
5682  b1    r2
5683  f1  f+3*
5684  b3    b3
5685  r1   u+3

[5686 rows x 2 columns]

In [745]:
df_returning_2nd_oppo_dir1 = df_returning_2nd_all_shot_pairs.loc[df_returning_2nd_all_shot_pairs["3"].str.contains("1", case = True)]
df_returning_2nd_oppo_dir1

        3     4
5      b1    f2
20     f1    f2
27     f1    r#
35    f-1    r3
42     f1    f2
...   ...   ...
5673   f1  f2n#
5675   f1    f1
5682   b1    r2
5683   f1  f+3*
5685   r1   u+3

[1482 rows x 2 columns]

In [746]:
df_returning_2nd_oppo_dir2 = df_returning_2nd_all_shot_pairs.loc[df_returning_2nd_all_shot_pairs["3"].str.contains("2", case = True)]
df_returning_2nd_oppo_dir2

       3    4
0     b2   f3
4     f2   f1
8     b2   b2
11    f2  b1*
13    b2   s3
...   ..  ...
5654  b2   b2
5662  f2   f1
5667  b2   f3
5674  s2   f1
5676  f2   b3

[1662 rows x 2 columns]

In [747]:
df_returning_2nd_oppo_dir3 = df_returning_2nd_all_shot_pairs.loc[df_returning_2nd_all_shot_pairs["3"].str.contains("3", case = True)]
df_returning_2nd_oppo_dir3

       3     4
1     s3    b3
2     f3    s2
3     f3    b2
6     f3  b2d@
7     b3    b3
...   ..   ...
5678  f3    b3
5679  b3    b3
5680  b3    b1
5681  f3    b3
5684  b3    b3

[2451 rows x 2 columns]

In [748]:
df_returning_2nd_oppo_dir1_djoko_dir1 = df_returning_2nd_oppo_dir1.loc[df_returning_2nd_oppo_dir1["4"].str.contains("1", case=True)]
df_returning_2nd_oppo_dir1_djoko_dir1

       3    4
46    f1  f1*
47    f1   f1
53    f1   f1
55    f1   f1
61    f1   f1
...   ..  ...
5660  b1   f1
5663  b1   f1
5669  f1   f1
5670  f1   f1
5675  f1   f1

[663 rows x 2 columns]

In [749]:
df_returning_2nd_oppo_dir1_djoko_dir2 = df_returning_2nd_oppo_dir1.loc[df_returning_2nd_oppo_dir1["4"].str.contains("2", case=True)]
df_returning_2nd_oppo_dir1_djoko_dir2

       3     4
5     b1    f2
20    f1    f2
42    f1    f2
43    f1    r2
51    b1    f2
...   ..   ...
5640  b1  f2d#
5661  f1    f2
5668  f1    f2
5673  f1  f2n#
5682  b1    r2

[426 rows x 2 columns]

In [750]:
df_returning_2nd_oppo_dir1_djoko_dir3 = df_returning_2nd_oppo_dir1.loc[df_returning_2nd_oppo_dir1["4"].str.contains("3", case=True)]
df_returning_2nd_oppo_dir1_djoko_dir3

        3     4
35    f-1    r3
99     f1    f3
133    b1  f3w#
171    f1  f3n#
172    f1    f3
...   ...   ...
5629   f1    f3
5630   r1    f3
5632   r1  f3d@
5683   f1  f+3*
5685   r1   u+3

[383 rows x 2 columns]

In [828]:
len(df_returning_2nd_oppo_dir1_djoko_dir1.loc[df_returning_2nd_oppo_dir1_djoko_dir1["4"].str.contains("q", case = True)])

0

In [829]:
len(df_returning_2nd_oppo_dir1_djoko_dir2.loc[df_returning_2nd_oppo_dir1_djoko_dir2["4"].str.contains("q", case = True)])

0

In [830]:
len(df_returning_2nd_oppo_dir1_djoko_dir3.loc[df_returning_2nd_oppo_dir1_djoko_dir3["4"].str.contains("q", case = True)])

0

In [831]:
df_returning_2nd_oppo_dir1_djoko_dir1["4"] = df_returning_2nd_oppo_dir1_djoko_dir1["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir1_djoko_dir1.loc[df_returning_2nd_oppo_dir1_djoko_dir1["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2089253962.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir1_djoko_dir1["4"] = df_returning_2nd_oppo_dir1_djoko_dir1["4"].str.replace('*', 'a')

23

In [832]:
df_returning_2nd_oppo_dir1_djoko_dir2["4"] = df_returning_2nd_oppo_dir1_djoko_dir2["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir1_djoko_dir2.loc[df_returning_2nd_oppo_dir1_djoko_dir2["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\611458433.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir1_djoko_dir2["4"] = df_returning_2nd_oppo_dir1_djoko_dir2["4"].str.replace('*', 'a')

3

In [833]:
df_returning_2nd_oppo_dir1_djoko_dir3["4"] = df_returning_2nd_oppo_dir1_djoko_dir3["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir1_djoko_dir3.loc[df_returning_2nd_oppo_dir1_djoko_dir3["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2775079096.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir1_djoko_dir3["4"] = df_returning_2nd_oppo_dir1_djoko_dir3["4"].str.replace('*', 'a')

20

In [834]:
df_returning_2nd_oppo_dir2

       3    4
0     b2   f3
4     f2   f1
8     b2   b2
11    f2  b1*
13    b2   s3
...   ..  ...
5654  b2   b2
5662  f2   f1
5667  b2   f3
5674  s2   f1
5676  f2   b3

[1662 rows x 2 columns]

In [838]:
df_returning_2nd_oppo_dir2_djoko_dir1 = df_returning_2nd_oppo_dir2.loc[df_returning_2nd_oppo_dir2["4"].str.contains("1", case=True)]
df_returning_2nd_oppo_dir2_djoko_dir1

       3    4
4     f2   f1
11    f2  b1*
32    b2   b1
49    f2   f1
54    b2   f1
...   ..  ...
5644  s2   f1
5651  b2   f1
5653  r2  v1*
5662  f2   f1
5674  s2   f1

[565 rows x 2 columns]

In [839]:
df_returning_2nd_oppo_dir2_djoko_dir2 = df_returning_2nd_oppo_dir2.loc[df_returning_2nd_oppo_dir2["4"].str.contains("2", case=True)]
df_returning_2nd_oppo_dir2_djoko_dir2

       3     4
8     b2    b2
22    f2    f2
24    b2    b2
26    b2    b2
28    f2    b2
...   ..   ...
5638  b2    s2
5641  f2    s2
5642  f2  b2d@
5643  f2    b2
5654  b2    b2

[462 rows x 2 columns]

In [840]:
df_returning_2nd_oppo_dir2_djoko_dir3 = df_returning_2nd_oppo_dir2.loc[df_returning_2nd_oppo_dir2["4"].str.contains("3", case=True)]
df_returning_2nd_oppo_dir2_djoko_dir3

        3    4
0      b2   f3
13     b2   s3
14     b2   s3
17     f2   b3
19     f2   f3
...   ...  ...
5581   f2  f3*
5605   r2  f+3
5645  f=2   f3
5667   b2   f3
5676   f2   b3

[630 rows x 2 columns]

In [913]:
len(df_returning_2nd_oppo_dir2_djoko_dir1.loc[df_returning_2nd_oppo_dir2_djoko_dir1["4"].str.contains("q", case = True)])

0

In [914]:
len(df_returning_2nd_oppo_dir2_djoko_dir2.loc[df_returning_2nd_oppo_dir2_djoko_dir2["4"].str.contains("q", case = True)])

0

In [915]:
len(df_returning_2nd_oppo_dir2_djoko_dir3.loc[df_returning_2nd_oppo_dir2_djoko_dir3["4"].str.contains("q", case = True)])

0

In [916]:
df_returning_2nd_oppo_dir2_djoko_dir1["4"] = df_returning_2nd_oppo_dir2_djoko_dir1["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir2_djoko_dir1.loc[df_returning_2nd_oppo_dir2_djoko_dir1["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1413253630.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir2_djoko_dir1["4"] = df_returning_2nd_oppo_dir2_djoko_dir1["4"].str.replace('*', 'a')

40

In [917]:
df_returning_2nd_oppo_dir2_djoko_dir2["4"] = df_returning_2nd_oppo_dir2_djoko_dir2["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir2_djoko_dir2.loc[df_returning_2nd_oppo_dir2_djoko_dir2["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\1968113461.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir2_djoko_dir2["4"] = df_returning_2nd_oppo_dir2_djoko_dir2["4"].str.replace('*', 'a')

4

In [918]:
df_returning_2nd_oppo_dir2_djoko_dir3["4"] = df_returning_2nd_oppo_dir2_djoko_dir3["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir2_djoko_dir3.loc[df_returning_2nd_oppo_dir2_djoko_dir3["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\4085587116.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir2_djoko_dir3["4"] = df_returning_2nd_oppo_dir2_djoko_dir3["4"].str.replace('*', 'a')

45

In [919]:
df_returning_2nd_oppo_dir3_djoko_dir1 = df_returning_2nd_oppo_dir3.loc[df_returning_2nd_oppo_dir3["4"].str.contains("1", case=True)]
df_returning_2nd_oppo_dir3_djoko_dir1

        3     4
12     b3    b1
23    b+3    s1
37     b3    b1
59     b3    b1
64     s3  s1w@
...   ...   ...
5655   f3    b1
5656   f3    b1
5664   y3  b1d#
5665  b;3   b+1
5680   b3    b1

[526 rows x 2 columns]

In [920]:
df_returning_2nd_oppo_dir3_djoko_dir2 = df_returning_2nd_oppo_dir3.loc[df_returning_2nd_oppo_dir3["4"].str.contains("2", case=True)]
df_returning_2nd_oppo_dir3_djoko_dir2

       3     4
2     f3    s2
3     f3    b2
6     f3  b2d@
16    b3    b2
31    b3    b2
...   ..   ...
5619  f3  b2d@
5620  b3    s2
5623  f3    b2
5635  s3    s2
5647  f3    f2

[566 rows x 2 columns]

In [921]:
df_returning_2nd_oppo_dir3_djoko_dir3 = df_returning_2nd_oppo_dir3.loc[df_returning_2nd_oppo_dir3["4"].str.contains("3", case=True)]
df_returning_2nd_oppo_dir3_djoko_dir3

       3     4
1     s3    b3
7     b3    b3
9     s3  b3n@
10    f3    b3
15    f3    b3
...   ..   ...
5677  b3    s3
5678  f3    b3
5679  b3    b3
5681  f3    b3
5684  b3    b3

[1348 rows x 2 columns]

In [998]:
len(df_returning_2nd_oppo_dir3_djoko_dir1.loc[df_returning_2nd_oppo_dir3_djoko_dir1["4"].str.contains("q", case = True)])

0

In [999]:
len(df_returning_2nd_oppo_dir3_djoko_dir2.loc[df_returning_2nd_oppo_dir3_djoko_dir2["4"].str.contains("q", case = True)])

0

In [1000]:
len(df_returning_2nd_oppo_dir3_djoko_dir3.loc[df_returning_2nd_oppo_dir3_djoko_dir3["4"].str.contains("q", case = True)])

0

In [1001]:
df_returning_2nd_oppo_dir3_djoko_dir1["4"] = df_returning_2nd_oppo_dir3_djoko_dir1["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir3_djoko_dir1.loc[df_returning_2nd_oppo_dir3_djoko_dir1["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3808535376.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir3_djoko_dir1["4"] = df_returning_2nd_oppo_dir3_djoko_dir1["4"].str.replace('*', 'a')

43

In [1002]:
df_returning_2nd_oppo_dir3_djoko_dir2["4"] = df_returning_2nd_oppo_dir3_djoko_dir2["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir3_djoko_dir2.loc[df_returning_2nd_oppo_dir3_djoko_dir2["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\3269967516.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir3_djoko_dir2["4"] = df_returning_2nd_oppo_dir3_djoko_dir2["4"].str.replace('*', 'a')

4

In [1003]:
df_returning_2nd_oppo_dir3_djoko_dir3["4"] = df_returning_2nd_oppo_dir3_djoko_dir3["4"].str.replace('*', 'a')
len(df_returning_2nd_oppo_dir3_djoko_dir3.loc[df_returning_2nd_oppo_dir3_djoko_dir3["4"].str.contains("a", case = True)])

C:\Users\carlo\AppData\Local\Temp\ipykernel_5296\2047149859.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_returning_2nd_oppo_dir3_djoko_dir3["4"] = df_returning_2nd_oppo_dir3_djoko_dir3["4"].str.replace('*', 'a')

45